### Testing the waters with sample relational data
----
Based on well defined theory and availability of highly mature, scalable and accessible relational database systems like Postgres, MariaDB and other commercial alternatives, relational data is pervasive in modern software development. Though, off late, the dominance of SQL systems is being challenged by flexibility of some No-SQL datastores, relational data and datastore continue to be an important source of raw datasets for many data analysis projects.

In this part we start-off with a simple relational dataset which will be augmented with more complexity as we proceed through the section. This dataset is then analysed using Pandas - a very nifty python package for working with various kinds of data, especially, tabular and relational data.

#### Why not use one of the many popular datasets
----
Being able to mentally replicate and cross check the result of an algorithm is pretty important in gaining confidence in data analysis. This is not always possible with, say, the Petals dataset or Reuters dataset for that matter. We therefore construct a small dataset of a nature which could very easily be found in many modern codebases.

In [1]:
import pandas as pd

# Some basic data

c = [
    { 'name': 'John', 'age': 29, 'id': 1 },
    { 'name': 'Doe', 'age': 19, 'id': 2 },
    { 'name': 'Alex', 'age': 32, 'id': 3 },
    { 'name': 'Rahul', 'age': 27, 'id': 4 }
]

c

[{'age': 29, 'id': 1, 'name': 'John'},
 {'age': 19, 'id': 2, 'name': 'Doe'},
 {'age': 32, 'id': 3, 'name': 'Alex'},
 {'age': 27, 'id': 4, 'name': 'Rahul'}]

In [2]:
# Using the above data as Foreign Key (FK)
t = [
    { 'user_id': 1, 'likes': 'Mango' },
    { 'user_id': 1, 'likes': 'Pepsi' },
    { 'user_id': 2, 'likes': 'Burger' },
    { 'user_id': 2, 'likes': 'Mango' },
    { 'user_id': 3, 'likes': 'Cola' },
    { 'user_id': 4, 'likes': 'Orange' },
    { 'user_id': 3, 'likes': 'Cola' },
    { 'user_id': 2, 'likes': 'Pepsi' },
    { 'user_id': 3, 'likes': 'Carrot' }
]

t

[{'likes': 'Mango', 'user_id': 1},
 {'likes': 'Pepsi', 'user_id': 1},
 {'likes': 'Burger', 'user_id': 2},
 {'likes': 'Mango', 'user_id': 2},
 {'likes': 'Cola', 'user_id': 3},
 {'likes': 'Orange', 'user_id': 4},
 {'likes': 'Cola', 'user_id': 3},
 {'likes': 'Pepsi', 'user_id': 2},
 {'likes': 'Carrot', 'user_id': 3}]

In [3]:
# Create Pandas DataFrame object and set
# appropriate index
df1 = pd.DataFrame(c)
df1.set_index('id')
df1

   age  id   name
0   29   1   John
1   19   2    Doe
2   32   3   Alex
3   27   4  Rahul

In [4]:
df2 = pd.DataFrame(t)
df2.set_index('user_id')
df2

    likes  user_id
0   Mango        1
1   Pepsi        1
2  Burger        2
3   Mango        2
4    Cola        3
5  Orange        4
6    Cola        3
7   Pepsi        2
8  Carrot        3

In [5]:
# Using the FK relation to create a join
pd.merge(df1, df2, left_on='id', right_on='user_id')
m = pd.merge(df1, df2, left_on='id', right_on='user_id')
m.set_index('user_id')
m

   age  id   name   likes  user_id
0   29   1   John   Mango        1
1   29   1   John   Pepsi        1
2   19   2    Doe  Burger        2
3   19   2    Doe   Mango        2
4   19   2    Doe   Pepsi        2
5   32   3   Alex    Cola        3
6   32   3   Alex    Cola        3
7   32   3   Alex  Carrot        3
8   27   4  Rahul  Orange        4

In [6]:
# Changing left and right hand side of the relationship
m2 = pd.merge(df2, df1, left_on='user_id', right_on='id')
m2.set_index('user_id')
m2

    likes  user_id  age  id   name
0   Mango        1   29   1   John
1   Pepsi        1   29   1   John
2  Burger        2   19   2    Doe
3   Mango        2   19   2    Doe
4   Pepsi        2   19   2    Doe
5    Cola        3   32   3   Alex
6    Cola        3   32   3   Alex
7  Carrot        3   32   3   Alex
8  Orange        4   27   4  Rahul

### Basic Aggregation Operations

In [7]:
# Food wise count of likes
m.groupby('likes')
m.groupby('likes')['likes'].count()